cpp_armadillo.org
#+TITLE: C++ - Armadillo

* Introduction
/Armadillo/[fn:1] is an excellent C++ library, which provides efficient linear algebra related operations, based on a series of classes, e.g., for vectors, matrices, etc. Thanks to its friendly interfaces, similar to /MATLAB/, the library is very easy to use.

Armadillo is developped by Conrad Sanderson and Ryan Curtin, and released under [[https://tldrlegal.com/license/apache-license-2.0-(apache-2.0)][Apache 2.0 license]].
* Installation
Matrix decomposition related operations are developped based on the existing third-party libraries, e.g., the open source [[https://github.com/xianyi/OpenBLAS.git][OpenBLAS]] or [[http://www.netlib.org/lapack][LAPACK]], or even the commercial [[http://software.intel.com/en-us/intel-mkl][MKL]]. In my opinion, openBLAS is the best choice, and can be installed in ArchLinux.
#+begin_src shell
  pacman -S openblas
#+end_src

The latest codes resides in a git repository[fn:2]. Based on the source codes can be compiled and installed as usual.

Besides, the library can be easily installed as system package. Taking ArchLinux for instance, armadillo can be installed by
#+begin_src shell
  pacman -S armadillo
#+end_src
* Usage
Note that the detailed usage of the libraries can be found in its [[https://arma.sourceforge.net/docs.html][online manual]], and this post just provides a brief and incomplete summary as a quick lookup reference after my walking through the manual.
** Typedef for basic elements
- =uword= is a typedef for =unsigned int=.
- =sword= is a typedef for =(signed) int=.
- =cx_float= is a typedef for =std::complex<float>=.
- =cx_double= is a typedef for =std::complex<double>=.
** Fill form
The library defines a series of =fill_form=, which significantly facilitates the initialization of the data type classes.
- =fill::zeros= sets all elements to 0.
- =fill::ones= sets all elements to 1.
- =fill::eye= initializes a matrix as an identity matrix.
- =fill::randu= sets all elements to uniform distributed random values, i.e., $\mathbb{U}(0, 1)$.
- =fill::randn= sets all elements to standard Gaussian distributed random values, i.e., $\mathbb{N}(0, 1)$.
- =fill::value(scalar)= sets all elements to a specified scalar.
- =fill::none= does not initialize the elements.
** Classes
*** Matrix
Considering the type of component elements, matrix is defined as a template =Mat<type>=, where =type= can be signed or unsigned, real or complex, int or float or even double. A matrix is column-wise stored in the memory.
**** Typedef
Moreover, following types have been defined for convenience.
- =imat= is a typedef for =Mat<sword>=.
- =umat= is a typedef for =Mat<uword>=.
- =fmat= is a typedef for =Mat<float>=.
- =mat= or =dmat= are both typedefs for =Mat<double>=.
- =cx_fmat= is a typedef for =Mat<cx_float>=.
- =cx_mat= and =cx_dmat= are both typedefs for =Mat<cx_double>=.
**** Constructor
A rich number of constructors have been defined, e.g., taking =mat= for instance,
- =mat()=
- =mat(n_rows, n_cols)=
- =mat(n_rows, n_cols, fill_form)=
- =mat::fixed<n_rows, n_cols>= creates a matrix with fixed size.
- =mat::fixed<n_rows, n_cols>(fill_form)=
- =mat(size(X))=
- =mat(size(X), fill_form)=
- =mat(mat)=
- =mat(vec)=
- =mat(rowvec)=
- =mat(initializer_list)=
- =mat(string)=
- =mat(std::vector)= creates a column vector, as a single-column matrix.
- =mat(sp_mat)= creates a dense matrix based on a sparse matrix.
- =cx_mat(mat, mat)= constructs a complex matrix based on a pair of real matrices, as real and imaginary parts respectively.
**** Submatrix view
***** Continuous
- =X.col(idx)= / =X.row(idx)=
- =X.cols(idx1, idx2)= / =X.rows(idx1, idx2)=
- =X.submat(row1, col1, row2, col2)=
- =X(span(row1, row2), span(col1, col2))=
- =X(row, col, size(n_rows, n_cols))= / =X(row, col, size(Y))=
- =X(span(row1, row2), col)=
- =X(row, span(col1, col2))=
- =X.head_cols(n_cols)= / =X.head_rows(n_rows)=
- =X.tail_cols(n_cols)= / =X.tail_rows(n_rows)=

=span= defines a continuous range, e.g.,
- =span(a, b)= describes a contiguous range from $a$ to $b$, $a < b$.
- =span(a)= indicates a particular row/column/slice.
- =span()= or =span::all= indicates the entire range.
***** Non-continuous
- =X.cols(idx_vec)= / =X.rows(idx_vec)=
- =X.submat(row_vec, col_vec)=
- =X(row_vec, col_vec)=
