cpp_armadillo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-24 Fri 01:08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ - Armadillo</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">C++ - Armadillo</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org99c4fc7">Introduction</a></li>
<li><a href="#org89e2d71">Installation</a></li>
<li><a href="#orgffb383f">Usage</a>
<ul>
<li><a href="#org459f400">Typedef for basic elements</a></li>
<li><a href="#orgcb58472">Fill form</a></li>
<li><a href="#org2fe505b">Classes</a>
<ul>
<li><a href="#orgf62c507">Matrix</a>
<ul>
<li><a href="#org17484f2">Typedef</a></li>
<li><a href="#org954e2ed">Constructor</a></li>
<li><a href="#org100f968">Submatrix view</a>
<ul>
<li><a href="#orga62991c">Continuous</a></li>
<li><a href="#org317c8ff">Non-continuous</a></li>
</ul>
</li>
<li><a href="#org5fb83ad">Member functions</a></li>
</ul>
</li>
<li><a href="#orgecbd894">Vector</a>
<ul>
<li><a href="#org8060c42">Typedef</a>
<ul>
<li><a href="#orgf587f9a">Column vector</a></li>
<li><a href="#orga518eb6">Row vector</a></li>
</ul>
</li>
<li><a href="#org044669a">Constructor</a></li>
<li><a href="#orgaf36b90">Subvector view</a>
<ul>
<li><a href="#orgfa79f2a">Continuous</a></li>
<li><a href="#org4f4f115">Non-continuous</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org764a3bd">Cube</a>
<ul>
<li><a href="#orgdb0ada5">Typedef</a></li>
<li><a href="#orgadd395b">Constructor</a></li>
<li><a href="#org71ac4a7">Subcube view</a>
<ul>
<li><a href="#org5eeddfc">Contiguous</a></li>
<li><a href="#org63acfa0">Non-contiguous</a></li>
</ul>
</li>
<li><a href="#org477ef75">Member functions</a></li>
</ul>
</li>
<li><a href="#org0a16ea7">Field</a>
<ul>
<li><a href="#org04d45f3">Constructor</a></li>
<li><a href="#org10374f6">Subfield view</a>
<ul>
<li><a href="#org8caef7f">For a 2D field</a></li>
<li><a href="#org06fe114">For a 3D field</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf11c982">Length and size</a></li>
<li><a href="#org3fd839e">Common member functions</a></li>
<li><a href="#orgb6b7ca6">Overloaded operators</a></li>
<li><a href="#orgcdd042e">Element access</a>
<ul>
<li><a href="#org32e2209">Iterators</a>
<ul>
<li><a href="#orgeb43b6b">Member functions</a></li>
<li><a href="#org4df0453">Iterator types</a>
<ul>
<li><a href="#orge679364">For read/write access</a></li>
<li><a href="#orgbcdb09a">For read-only access</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd3a4d86">Container-compatible functions</a></li>
</ul>
</li>
<li><a href="#org52ce5bf">Generation</a>
<ul>
<li><a href="#org33e417d">Matrix</a></li>
<li><a href="#org2d176c6">Vector</a></li>
<li><a href="#org872b215">Cube</a></li>
</ul>
</li>
<li><a href="#org8a6871a">Functions</a>
<ul>
<li><a href="#orgb779166">Matrix</a></li>
<li><a href="#org7462d4c">Vector</a></li>
<li><a href="#org39491bc">Cube</a></li>
</ul>
</li>
<li><a href="#org6b12521">Miscellaneous</a>
<ul>
<li><a href="#orgf1c5857">Constant</a></li>
<li><a href="#org94c9909">Timer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org99c4fc7" class="outline-2">
<h2 id="org99c4fc7">Introduction</h2>
<div class="outline-text-2" id="text-org99c4fc7">
<p>
<i>Armadillo</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> is an excellent C++ library, which provides efficient linear algebra related operations, based on a series of classes, e.g., for vectors, matrices, etc. Thanks to its friendly interfaces, similar to <i>MATLAB</i>, the library is very easy to use.
</p>

<p>
Armadillo is developped by Conrad Sanderson and Ryan Curtin, and released under <a href="https://tldrlegal.com/license/apache-license-2.0-(apache-2.0)">Apache 2.0 license</a>.
</p>
</div>
</div>
<div id="outline-container-org89e2d71" class="outline-2">
<h2 id="org89e2d71">Installation</h2>
<div class="outline-text-2" id="text-org89e2d71">
<p>
Matrix decomposition related operations are developped based on the existing third-party libraries, e.g., the open source <a href="https://github.com/xianyi/OpenBLAS.git">OpenBLAS</a> or <a href="http://www.netlib.org/lapack">LAPACK</a>, or even the commercial <a href="http://software.intel.com/en-us/intel-mkl">MKL</a>. In my opinion, openBLAS is the best choice, and can be installed in ArchLinux.
</p>
<div class="org-src-container">
<pre class="src src-shell">pacman -S openblas
</pre>
</div>

<p>
The latest codes resides in a git repository<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. Based on the source codes can be compiled and installed as usual.
</p>

<p>
Besides, the library can be easily installed as system package. Taking ArchLinux for instance, armadillo can be installed by
</p>
<div class="org-src-container">
<pre class="src src-shell">pacman -S armadillo
</pre>
</div>
</div>
</div>
<div id="outline-container-orgffb383f" class="outline-2">
<h2 id="orgffb383f">Usage</h2>
<div class="outline-text-2" id="text-orgffb383f">
<p>
Note that the detailed usage of the libraries can be found in its <a href="https://arma.sourceforge.net/docs.html">online manual</a>, and this post just provides a brief and incomplete summary as a quick lookup reference after my walking through the manual.
</p>
</div>
<div id="outline-container-org459f400" class="outline-3">
<h3 id="org459f400">Typedef for basic elements</h3>
<div class="outline-text-3" id="text-org459f400">
<ul class="org-ul">
<li><code>uword</code> is a typedef for <code>unsigned int</code>.</li>
<li><code>sword</code> is a typedef for <code>(signed) int</code>.</li>
<li><code>cx_float</code> is a typedef for <code>std::complex&lt;float&gt;</code>.</li>
<li><code>cx_double</code> is a typedef for <code>std::complex&lt;double&gt;</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb58472" class="outline-3">
<h3 id="orgcb58472">Fill form</h3>
<div class="outline-text-3" id="text-orgcb58472">
<p>
The library defines a series of <code>fill_form</code>, which significantly facilitates the initialization of the data type classes.
</p>
<ul class="org-ul">
<li><code>fill::zeros</code> sets all elements to 0.</li>
<li><code>fill::ones</code> sets all elements to 1.</li>
<li><code>fill::eye</code> initializes a matrix as an identity matrix.</li>
<li><code>fill::randu</code> sets all elements to uniform distributed random values, i.e., \(\mathbb{U}(0, 1)\).</li>
<li><code>fill::randn</code> sets all elements to standard Gaussian distributed random values, i.e., \(\mathbb{N}(0, 1)\).</li>
<li><code>fill::value(scalar)</code> sets all elements to a specified scalar.</li>
<li><code>fill::none</code> does not initialize the elements.</li>
</ul>
</div>
</div>
<div id="outline-container-org2fe505b" class="outline-3">
<h3 id="org2fe505b">Classes</h3>
<div class="outline-text-3" id="text-org2fe505b">
</div>
<div id="outline-container-orgf62c507" class="outline-4">
<h4 id="orgf62c507">Matrix</h4>
<div class="outline-text-4" id="text-orgf62c507">
<p>
Considering the type of component elements, matrix is defined as a template <code>Mat&lt;type&gt;</code>, where <code>type</code> can be signed or unsigned, real or complex, int or float or even double. A matrix is column-wise stored in the memory.
</p>
</div>
<div id="outline-container-org17484f2" class="outline-5">
<h5 id="org17484f2">Typedef</h5>
<div class="outline-text-5" id="text-org17484f2">
<p>
Moreover, following types have been defined for convenience.
</p>
<ul class="org-ul">
<li><code>imat</code> is a typedef for <code>Mat&lt;sword&gt;</code>.</li>
<li><code>umat</code> is a typedef for <code>Mat&lt;uword&gt;</code>.</li>
<li><code>fmat</code> is a typedef for <code>Mat&lt;float&gt;</code>.</li>
<li><code>mat</code> or <code>dmat</code> are both typedefs for <code>Mat&lt;double&gt;</code>.</li>
<li><code>cx_fmat</code> is a typedef for <code>Mat&lt;cx_float&gt;</code>.</li>
<li><code>cx_mat</code> and <code>cx_dmat</code> are both typedefs for <code>Mat&lt;cx_double&gt;</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org954e2ed" class="outline-5">
<h5 id="org954e2ed">Constructor</h5>
<div class="outline-text-5" id="text-org954e2ed">
<p>
A rich number of constructors have been defined, e.g., taking <code>mat</code> for instance,
</p>
<ul class="org-ul">
<li><code>mat()</code></li>
<li><code>mat(n_rows, n_cols)</code></li>
<li><code>mat(n_rows, n_cols, fill_form)</code></li>
<li><code>mat::fixed&lt;n_rows, n_cols&gt;</code> creates a matrix with fixed size.</li>
<li><code>mat::fixed&lt;n_rows, n_cols&gt;(fill_form)</code></li>
<li><code>mat(size(X))</code></li>
<li><code>mat(size(X), fill_form)</code></li>
<li><code>mat(mat)</code></li>
<li><code>mat(vec)</code></li>
<li><code>mat(rowvec)</code></li>
<li><code>mat(initializer_list)</code></li>
<li><code>mat(string)</code></li>
<li><code>mat(std::vector)</code> creates a column vector, as a single-column matrix.</li>
<li><code>mat(sp_mat)</code> creates a dense matrix based on a sparse matrix.</li>
<li><code>cx_mat(mat, mat)</code> constructs a complex matrix based on a pair of real matrices, as real and imaginary parts respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-org100f968" class="outline-5">
<h5 id="org100f968">Submatrix view</h5>
<div class="outline-text-5" id="text-org100f968">
</div>
<div id="outline-container-orga62991c" class="outline-6">
<h6 id="orga62991c">Continuous</h6>
<div class="outline-text-6" id="text-orga62991c">
<ul class="org-ul">
<li><code>X.col(idx)</code> / <code>X.row(idx)</code></li>
<li><code>X.cols(idx1, idx2)</code> / <code>X.rows(idx1, idx2)</code></li>
<li><code>X.submat(row1, col1, row2, col2)</code></li>
<li><code>X(span(row1, row2), span(col1, col2))</code></li>
<li><code>X(row, col, size(n_rows, n_cols))</code> / <code>X(row, col, size(Y))</code></li>
<li><code>X(span(row1, row2), col)</code></li>
<li><code>X(row, span(col1, col2))</code></li>
<li><code>X.head_cols(n_cols)</code> / <code>X.head_rows(n_rows)</code></li>
<li><code>X.tail_cols(n_cols)</code> / <code>X.tail_rows(n_rows)</code></li>
</ul>

<p>
<code>span</code> defines a continuous range, e.g.,
</p>
<ul class="org-ul">
<li><code>span(a, b)</code> describes a contiguous range from \(a\) to \(b\), \(a < b\).</li>
<li><code>span(a)</code> indicates a particular row/column/slice.</li>
<li><code>span()</code> or <code>span::all</code> indicates the entire range.</li>
</ul>
</div>
</div>
<div id="outline-container-org317c8ff" class="outline-6">
<h6 id="org317c8ff">Non-continuous</h6>
<div class="outline-text-6" id="text-org317c8ff">
<ul class="org-ul">
<li><code>X.cols(idx_vec)</code> / <code>X.rows(idx_vec)</code></li>
<li><code>X.submat(row_vec, col_vec)</code></li>
<li><code>X(row_vec, col_vec)</code></li>
</ul>
</div>
</div>
</div>
