cpp_armadillo.org
**** Member functions
- =.eye()= : Set the matrix to an identity matrix.
- =.diag(k = 0)= : Return a column vector of a matrix.
- =.as_col()= / =.as_row()= : Return a column/row vector by concatenating all the columns/rows of the matrix.
- =.each_col(idx_vec)= / =.each_row(idx_vec)= / =.each_col(lambda)= / =.each_row(lambda)= : Apply a vector operation to each column/row of a matrix. The argument =idx_vec= is optional, and by default all columns/rows are used. If the lambda function =lambda= is specified, then the function must accept a reference to a =Col<type>= or =Row<type>= object with the same element type as the underlying matrix. Following operations have been supported.
  + =+/-//= : Addition/subtraction/division
  + =%= : Element-wise multiplication
  + === : Assignment (copy)
  + =+=/-=//== : In-place addition/subtraction/division
  + =%== : In-place element-wise multiplication
- =.st()= : Return a transposed copy (only applicable for a complex matrix)
- =.t()= : Return a Hermitian transposed copy[fn:5].
- =.i()= : Return the inverse for a square matrix.
- =.is_square()=
- =.is_vec()= : Return =true= if the matrix is a column or row vector.
- =.is_colvec= / =.is_rowvec=
- =.is_trimatu()= / =.is_trimatl()=
- =.is_diagmat()=
*** Vector
In the library, column vectors and row vectors are different, represented by =Col<type>= and =Row<type>= respectively.
**** Typedef
***** Column vector
- =icolvec= and =ivec= are both typedefs for =Col<sword>=.
- =ucolvec= and =uvec= are both typedefs for =Col<uword>=.
- =fcolvec= and =fvec= are both typedefs for =Col<float>=.
- =dcolvec=, =dvec=, =colvec= and =vec= are all typedefs for =Col<double>=.
- =cx_fcolvec= and =cx_fvec= are both typedefs for =Col<cx_float>=.
- =cx_dcolvec=, =cx_dvec=, =cx_colvec= and =cx_vec= are all typedefs for =Col<cx_double>=.
***** Row vector
- =irowvec= is a typedef for =Row<sword>=.
- =urowvec= is a typedef for =Row<uword>=.
- =frowvec= is a typedef for =Row<float>=.
- =drowvec= and =rowvec= are both typedefs for =Row<double>=.
**** Constructor
Taking =vec/rowvec= for instance, following constructs have been defined.
- =vec/rowvec()=
- =vec/rowvec(n_elem)=
- =vec/rowvec(n_elem, fill_form)=
- =vec/rowvec::fixed<n_elem>= creates a column/row vector with fixed size.
- =vec/rowvec::fixed<n_elem>(fill_form)=
- =vec/rowvec(size(X))=
- =vec/rowvec(size(X), fill_form)=
- =vec/rowvec(vec/rowvec)=
- =vec/rowvec(mat)= creates a column/row vector based on a single-column/row matrix.
- =vec/rowvec(initializer_list)=
- =vec/rowvec(string)= creates a column/row vector based on a string with space as delimitor.
- =vec/rowvec(std::vector)= creates a column/row vector based on a vector container in STL.
- =cx_vec/rowvec(vec/rowvec, vec/rowvec)= constructs a complex column/row vector based on a pair of real column/row vectors, as real and imaginary parts respectively.
**** Subvector view
***** Continuous
- =V(span(idx1, idx2))=
- =V.subvec(idx1, idx2)= / =V.subvec(idx, size(U))=
- =V.head(n_elem)= / =V.tail(n_elem)=
***** Non-continuous
- =X.elem(idx_vec)= / =X(idx_vec)=
*** Cube
A cube is essentially a 3-dimension (3D) matrix, which is compriesd of a series of 2D matrices, a.k.a. /slices/. Cube class is also a template, i.e., =Cube<type>=.
**** Typedef
- =icube= is a typedef for =Cube<sword>=.
- =ucube= is a typedef for =Cube<uword>=.
- =fcube= is a typedef for =Cube<float>=.
- =dcube= and =cube= are both typedefs for =Cube<double>=.
- =cx_fcube= is a typedef for =Cube<cx_float>=.
- =cx_dcube= and =cx_cube= are both typedefs for =Cube<cx_double>=.
**** Constructor
- =cube()=
- =cube(n_rows, n_cols, n_slices)=
- =cube(n_rows, n_cols, n_slices, fill_form)=
- =cube::fixed<n_rows, n_cols, n_slices>= creates a cube with fixed size.
- =cube(size(X))=
- =cube(size(X), fill_form)=
- =cube(cube)=
- =cx_cube(cube, cube)= constructs a complex cube based on a pair of real cubes, as real and imaginary parts respectively.
**** Subcube view
***** Contiguous
- =Q.slice(idx)= / =Q.slices(idx1, idx2)=
- =Q.col_as_mat(idx)= / =Q.row_as_mat(idx)= returns a flattened matrix.
- =Q.row(idx)= / =Q.col(idx)=
- =Q.rows(idx1, idx2)= / =Q.cols(idx1, idx2)=
- =Q.subcube(row1, col1, slice1, row2, col2, slice2)=
- =Q(span(row1, row2), span(col1, col2), span(slice1, slice2))=
- =Q(row1, col1, slice1, size(n_rows, n_cols, n_slices))= / =Q(row, col, slice, size(R))=
- =Q.head_slices(n_slices)= / =Q.tail_slices(n_slices)=
- =Q.tube(row, col)=[fn:4] / =Q.tube(row1, col1, row2, col2)= / =Q.tube(span(row1, row2), span(col1, col2))= / =Q.tube(row, col, size(n_rows, n_cols))=
***** Non-contiguous
- =Q.elem(idx_vec)=
- =Q(idx_vec)=
- =Q.slices(idx_vec)=
