cpp_armadillo.html
<div id="outline-container-org5fb83ad" class="outline-5">
<h5 id="org5fb83ad">Member functions</h5>
<div class="outline-text-5" id="text-org5fb83ad">
<ul class="org-ul">
<li><code>.eye()</code> : Set the matrix to an identity matrix.</li>
<li><code>.diag(k = 0)</code> : Return a column vector of a matrix.</li>
<li><code>.as_col()</code> / <code>.as_row()</code> : Return a column/row vector by concatenating all the columns/rows of the matrix.</li>
<li><code>.each_col(idx_vec)</code> / <code>.each_row(idx_vec)</code> / <code>.each_col(lambda)</code> / <code>.each_row(lambda)</code> : Apply a vector operation to each column/row of a matrix. The argument <code>idx_vec</code> is optional, and by default all columns/rows are used. If the lambda function <code>lambda</code> is specified, then the function must accept a reference to a <code>Col&lt;type&gt;</code> or <code>Row&lt;type&gt;</code> object with the same element type as the underlying matrix. Following operations have been supported.
<ul class="org-ul">
<li><code>+/-//</code> : Addition/subtraction/division</li>
<li><code>%</code> : Element-wise multiplication</li>
<li><code>=</code> : Assignment (copy)</li>
<li><code>+=/-=//=</code> : In-place addition/subtraction/division</li>
<li><code>%=</code> : In-place element-wise multiplication</li>
</ul></li>
<li><code>.st()</code> : Return a transposed copy (only applicable for a complex matrix)</li>
<li><code>.t()</code> : Return a Hermitian transposed copy<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.</li>
<li><code>.i()</code> : Return the inverse for a square matrix.</li>
<li><code>.is_square()</code></li>
<li><code>.is_vec()</code> : Return <code>true</code> if the matrix is a column or row vector.</li>
<li><code>.is_colvec</code> / <code>.is_rowvec</code></li>
<li><code>.is_trimatu()</code> / <code>.is_trimatl()</code></li>
<li><code>.is_diagmat()</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgecbd894" class="outline-4">
<h4 id="orgecbd894">Vector</h4>
<div class="outline-text-4" id="text-orgecbd894">
<p>
In the library, column vectors and row vectors are different, represented by <code>Col&lt;type&gt;</code> and <code>Row&lt;type&gt;</code> respectively.
</p>
</div>
<div id="outline-container-org8060c42" class="outline-5">
<h5 id="org8060c42">Typedef</h5>
<div class="outline-text-5" id="text-org8060c42">
</div>
<div id="outline-container-orgf587f9a" class="outline-6">
<h6 id="orgf587f9a">Column vector</h6>
<div class="outline-text-6" id="text-orgf587f9a">
<ul class="org-ul">
<li><code>icolvec</code> and <code>ivec</code> are both typedefs for <code>Col&lt;sword&gt;</code>.</li>
<li><code>ucolvec</code> and <code>uvec</code> are both typedefs for <code>Col&lt;uword&gt;</code>.</li>
<li><code>fcolvec</code> and <code>fvec</code> are both typedefs for <code>Col&lt;float&gt;</code>.</li>
<li><code>dcolvec</code>, <code>dvec</code>, <code>colvec</code> and <code>vec</code> are all typedefs for <code>Col&lt;double&gt;</code>.</li>
<li><code>cx_fcolvec</code> and <code>cx_fvec</code> are both typedefs for <code>Col&lt;cx_float&gt;</code>.</li>
<li><code>cx_dcolvec</code>, <code>cx_dvec</code>, <code>cx_colvec</code> and <code>cx_vec</code> are all typedefs for <code>Col&lt;cx_double&gt;</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orga518eb6" class="outline-6">
<h6 id="orga518eb6">Row vector</h6>
<div class="outline-text-6" id="text-orga518eb6">
<ul class="org-ul">
<li><code>irowvec</code> is a typedef for <code>Row&lt;sword&gt;</code>.</li>
<li><code>urowvec</code> is a typedef for <code>Row&lt;uword&gt;</code>.</li>
<li><code>frowvec</code> is a typedef for <code>Row&lt;float&gt;</code>.</li>
<li><code>drowvec</code> and <code>rowvec</code> are both typedefs for <code>Row&lt;double&gt;</code>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org044669a" class="outline-5">
<h5 id="org044669a">Constructor</h5>
<div class="outline-text-5" id="text-org044669a">
<p>
Taking <code>vec/rowvec</code> for instance, following constructs have been defined.
</p>
<ul class="org-ul">
<li><code>vec/rowvec()</code></li>
<li><code>vec/rowvec(n_elem)</code></li>
<li><code>vec/rowvec(n_elem, fill_form)</code></li>
<li><code>vec/rowvec::fixed&lt;n_elem&gt;</code> creates a column/row vector with fixed size.</li>
<li><code>vec/rowvec::fixed&lt;n_elem&gt;(fill_form)</code></li>
<li><code>vec/rowvec(size(X))</code></li>
<li><code>vec/rowvec(size(X), fill_form)</code></li>
<li><code>vec/rowvec(vec/rowvec)</code></li>
<li><code>vec/rowvec(mat)</code> creates a column/row vector based on a single-column/row matrix.</li>
<li><code>vec/rowvec(initializer_list)</code></li>
<li><code>vec/rowvec(string)</code> creates a column/row vector based on a string with space as delimitor.</li>
<li><code>vec/rowvec(std::vector)</code> creates a column/row vector based on a vector container in STL.</li>
<li><code>cx_vec/rowvec(vec/rowvec, vec/rowvec)</code> constructs a complex column/row vector based on a pair of real column/row vectors, as real and imaginary parts respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf36b90" class="outline-5">
<h5 id="orgaf36b90">Subvector view</h5>
<div class="outline-text-5" id="text-orgaf36b90">
</div>
<div id="outline-container-orgfa79f2a" class="outline-6">
<h6 id="orgfa79f2a">Continuous</h6>
<div class="outline-text-6" id="text-orgfa79f2a">
<ul class="org-ul">
<li><code>V(span(idx1, idx2))</code></li>
<li><code>V.subvec(idx1, idx2)</code> / <code>V.subvec(idx, size(U))</code></li>
<li><code>V.head(n_elem)</code> / <code>V.tail(n_elem)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org4f4f115" class="outline-6">
<h6 id="org4f4f115">Non-continuous</h6>
<div class="outline-text-6" id="text-org4f4f115">
<ul class="org-ul">
<li><code>X.elem(idx_vec)</code> / <code>X(idx_vec)</code></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org764a3bd" class="outline-4">
<h4 id="org764a3bd">Cube</h4>
<div class="outline-text-4" id="text-org764a3bd">
<p>
A cube is essentially a 3-dimension (3D) matrix, which is compriesd of a series of 2D matrices, a.k.a. <i>slices</i>. Cube class is also a template, i.e., <code>Cube&lt;type&gt;</code>.
</p>
</div>
<div id="outline-container-orgdb0ada5" class="outline-5">
<h5 id="orgdb0ada5">Typedef</h5>
<div class="outline-text-5" id="text-orgdb0ada5">
<ul class="org-ul">
<li><code>icube</code> is a typedef for <code>Cube&lt;sword&gt;</code>.</li>
<li><code>ucube</code> is a typedef for <code>Cube&lt;uword&gt;</code>.</li>
<li><code>fcube</code> is a typedef for <code>Cube&lt;float&gt;</code>.</li>
<li><code>dcube</code> and <code>cube</code> are both typedefs for <code>Cube&lt;double&gt;</code>.</li>
<li><code>cx_fcube</code> is a typedef for <code>Cube&lt;cx_float&gt;</code>.</li>
<li><code>cx_dcube</code> and <code>cx_cube</code> are both typedefs for <code>Cube&lt;cx_double&gt;</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgadd395b" class="outline-5">
<h5 id="orgadd395b">Constructor</h5>
<div class="outline-text-5" id="text-orgadd395b">
<ul class="org-ul">
<li><code>cube()</code></li>
<li><code>cube(n_rows, n_cols, n_slices)</code></li>
<li><code>cube(n_rows, n_cols, n_slices, fill_form)</code></li>
<li><code>cube::fixed&lt;n_rows, n_cols, n_slices&gt;</code> creates a cube with fixed size.</li>
<li><code>cube(size(X))</code></li>
<li><code>cube(size(X), fill_form)</code></li>
<li><code>cube(cube)</code></li>
<li><code>cx_cube(cube, cube)</code> constructs a complex cube based on a pair of real cubes, as real and imaginary parts respectively.</li>
</ul>
</div>
</div>
<div id="outline-container-org71ac4a7" class="outline-5">
<h5 id="org71ac4a7">Subcube view</h5>
<div class="outline-text-5" id="text-org71ac4a7">
</div>
<div id="outline-container-org5eeddfc" class="outline-6">
<h6 id="org5eeddfc">Contiguous</h6>
<div class="outline-text-6" id="text-org5eeddfc">
<ul class="org-ul">
<li><code>Q.slice(idx)</code> / <code>Q.slices(idx1, idx2)</code></li>
<li><code>Q.col_as_mat(idx)</code> / <code>Q.row_as_mat(idx)</code> returns a flattened matrix.</li>
<li><code>Q.row(idx)</code> / <code>Q.col(idx)</code></li>
<li><code>Q.rows(idx1, idx2)</code> / <code>Q.cols(idx1, idx2)</code></li>
<li><code>Q.subcube(row1, col1, slice1, row2, col2, slice2)</code></li>
<li><code>Q(span(row1, row2), span(col1, col2), span(slice1, slice2))</code></li>
<li><code>Q(row1, col1, slice1, size(n_rows, n_cols, n_slices))</code> / <code>Q(row, col, slice, size(R))</code></li>
<li><code>Q.head_slices(n_slices)</code> / <code>Q.tail_slices(n_slices)</code></li>
<li><code>Q.tube(row, col)</code><sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> / <code>Q.tube(row1, col1, row2, col2)</code> / <code>Q.tube(span(row1, row2), span(col1, col2))</code> / <code>Q.tube(row, col, size(n_rows, n_cols))</code></li>
</ul>
</div>
</div>
