cpp_armadillo.org
**** Member functions
- =.each_slice(idx_vec)= / =.each_slice(lambda)= / =.each_slice(lambda, use_mp = false)=: Apply a matrix operation to each slice/matrix of a cube. The argument =idx_vec= is optional, and by default all slices are used. If the lambda function =lambda= is specified, then the function must accept a reference to a =Mat<type>= object with the same element type as the underlying cube. =use_mp= is a boolean indicator of /OpenMP/ for multithreading. If it is set to =true=, then the =lambda= must be thread-safe, i.e., cannot write to variables outside of its scope.
- =.insert_slices(idx, X)= : Insert =X= at =idx= th slice.
- =.insert_slices(idx, slice_num)= : Insert =slice_num= slices at =idx= th slice, and the =slice_num= slices inserted are all set to 0.
- =.shed_slice(idx)= : Remove =idx= th slice from the underlying cube.
- =.shed_slices(first, last)= : Remove the slices between =first= th and =last= th slices.
- =.shed_slices(idx_vec)= : Remove the slices with indices in =idx_vec=.
*** Field
According to the online manual, a field is a class to store *arbitrary objects* in *matrix-like* or *cube-like* layouts. Given a vector or a matrix or a cube, all the elements (e.g., scalars in a vector, vectors in a matrix, matrices in a cube) must have the identical type and equal size. But in a field, the elements just have the identical type, but their lengths or sizes can be different from one element to another.
**** Constructor
A field object can be created by any one of the constructors below, where =object_type= is the element type, which can be vector or matrix or cube.
- =field<object_type>()=
- =field<object_type>(n_elem)=
- =field<object_type>(n_rows, n_cols)=
- =field<object_type>(n_rows, n_cols, n_slices)=
- =field<object_type>(size(X))=
- =field<object_type>(field<object_type>)=
**** Subfield view
***** For a 2D field
- =F.row(idx)=
- =F.col(idx)=
- =F.rows(row1, row2)=
- =F.cols(col1, col2)=
- =F.subfield(row1, col1, row2, col2)=
- =F(span(row1, row2), span(col1, col2))=
- =F(row, col, size(G))=
- =F(row, col, size(n_rows, n_cols))=
***** For a 3D field
- =F.slice(idx)=
- =F.slices(slice1, slice2)=
- =F.subfield(row1, col1, slice1, row2, col2, slice2)=
- =F(span(row1, row2), span(col1, col2), span(slice1, slice2))=
- =F(row, col, slice, size(G))=
- =F(row, col, slice, size(n_rows, n_cols, n_slices))=
** Length and size
Length and size related attributes of type =uword=, can be listed as below.
- =.n_elem= : Total number of elements in a vector/matrix/cube/field
- =.n_cols= : Number of columns in a vector/matrix/cube/field
- =.n_rows= : Number of rows in a vector/matrix/cube/field
- =.n_slices= : Number of slices in a cube/field
- =.n_nonzeros= : Number of non-zero elements in a sparse matrix

The dimensions above are all read-only, but can be changed by
- =.set_size(n_elem)= for a vector/field
- =.set_size(n_rows, n_cols)= for a matrix/field
- =.set_size(n_rows, n_cols, n_slices)= for a cube/field
- =.set_size(size(X))= for a vector/matrix/cube/field
- =.copy_size(X)= set the size equal to that of object X.
