cpp_armadillo.html
<div id="outline-container-org63acfa0" class="outline-6">
<h6 id="org63acfa0">Non-contiguous</h6>
<div class="outline-text-6" id="text-org63acfa0">
<ul class="org-ul">
<li><code>Q.elem(idx_vec)</code></li>
<li><code>Q(idx_vec)</code></li>
<li><code>Q.slices(idx_vec)</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org477ef75" class="outline-5">
<h5 id="org477ef75">Member functions</h5>
<div class="outline-text-5" id="text-org477ef75">
<ul class="org-ul">
<li><code>.each_slice(idx_vec)</code> / <code>.each_slice(lambda)</code> / <code>.each_slice(lambda, use_mp = false)</code>: Apply a matrix operation to each slice/matrix of a cube. The argument <code>idx_vec</code> is optional, and by default all slices are used. If the lambda function <code>lambda</code> is specified, then the function must accept a reference to a <code>Mat&lt;type&gt;</code> object with the same element type as the underlying cube. <code>use_mp</code> is a boolean indicator of <i>OpenMP</i> for multithreading. If it is set to <code>true</code>, then the <code>lambda</code> must be thread-safe, i.e., cannot write to variables outside of its scope.</li>
<li><code>.insert_slices(idx, X)</code> : Insert <code>X</code> at <code>idx</code> th slice.</li>
<li><code>.insert_slices(idx, slice_num)</code> : Insert <code>slice_num</code> slices at <code>idx</code> th slice, and the <code>slice_num</code> slices inserted are all set to 0.</li>
<li><code>.shed_slice(idx)</code> : Remove <code>idx</code> th slice from the underlying cube.</li>
<li><code>.shed_slices(first, last)</code> : Remove the slices between <code>first</code> th and <code>last</code> th slices.</li>
<li><code>.shed_slices(idx_vec)</code> : Remove the slices with indices in <code>idx_vec</code>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0a16ea7" class="outline-4">
<h4 id="org0a16ea7">Field</h4>
<div class="outline-text-4" id="text-org0a16ea7">
<p>
According to the online manual, a field is a class to store <b>arbitrary objects</b> in <b>matrix-like</b> or <b>cube-like</b> layouts. Given a vector or a matrix or a cube, all the elements (e.g., scalars in a vector, vectors in a matrix, matrices in a cube) must have the identical type and equal size. But in a field, the elements just have the identical type, but their lengths or sizes can be different from one element to another.
</p>
</div>
<div id="outline-container-org04d45f3" class="outline-5">
<h5 id="org04d45f3">Constructor</h5>
<div class="outline-text-5" id="text-org04d45f3">
<p>
A field object can be created by any one of the constructors below, where <code>object_type</code> is the element type, which can be vector or matrix or cube.
</p>
<ul class="org-ul">
<li><code>field&lt;object_type&gt;()</code></li>
<li><code>field&lt;object_type&gt;(n_elem)</code></li>
<li><code>field&lt;object_type&gt;(n_rows, n_cols)</code></li>
<li><code>field&lt;object_type&gt;(n_rows, n_cols, n_slices)</code></li>
<li><code>field&lt;object_type&gt;(size(X))</code></li>
<li><code>field&lt;object_type&gt;(field&lt;object_type&gt;)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org10374f6" class="outline-5">
<h5 id="org10374f6">Subfield view</h5>
<div class="outline-text-5" id="text-org10374f6">
</div>
<div id="outline-container-org8caef7f" class="outline-6">
<h6 id="org8caef7f">For a 2D field</h6>
<div class="outline-text-6" id="text-org8caef7f">
<ul class="org-ul">
<li><code>F.row(idx)</code></li>
<li><code>F.col(idx)</code></li>
<li><code>F.rows(row1, row2)</code></li>
<li><code>F.cols(col1, col2)</code></li>
<li><code>F.subfield(row1, col1, row2, col2)</code></li>
<li><code>F(span(row1, row2), span(col1, col2))</code></li>
<li><code>F(row, col, size(G))</code></li>
<li><code>F(row, col, size(n_rows, n_cols))</code></li>
</ul>
</div>
</div>
<div id="outline-container-org06fe114" class="outline-6">
<h6 id="org06fe114">For a 3D field</h6>
<div class="outline-text-6" id="text-org06fe114">
<ul class="org-ul">
<li><code>F.slice(idx)</code></li>
<li><code>F.slices(slice1, slice2)</code></li>
<li><code>F.subfield(row1, col1, slice1, row2, col2, slice2)</code></li>
<li><code>F(span(row1, row2), span(col1, col2), span(slice1, slice2))</code></li>
<li><code>F(row, col, slice, size(G))</code></li>
<li><code>F(row, col, slice, size(n_rows, n_cols, n_slices))</code></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf11c982" class="outline-3">
<h3 id="orgf11c982">Length and size</h3>
<div class="outline-text-3" id="text-orgf11c982">
<p>
Length and size related attributes of type <code>uword</code>, can be listed as below.
</p>
<ul class="org-ul">
<li><code>.n_elem</code> : Total number of elements in a vector/matrix/cube/field</li>
<li><code>.n_cols</code> : Number of columns in a vector/matrix/cube/field</li>
<li><code>.n_rows</code> : Number of rows in a vector/matrix/cube/field</li>
<li><code>.n_slices</code> : Number of slices in a cube/field</li>
<li><code>.n_nonzeros</code> : Number of non-zero elements in a sparse matrix</li>
</ul>

<p>
The dimensions above are all read-only, but can be changed by
</p>
<ul class="org-ul">
<li><code>.set_size(n_elem)</code> for a vector/field</li>
<li><code>.set_size(n_rows, n_cols)</code> for a matrix/field</li>
<li><code>.set_size(n_rows, n_cols, n_slices)</code> for a cube/field</li>
<li><code>.set_size(size(X))</code> for a vector/matrix/cube/field</li>
<li><code>.copy_size(X)</code> set the size equal to that of object X.</li>
</ul>
</div>
</div>
