cpp_armadillo.org
** Common member functions
- =.zeros()= : Set all elements to 0.
- =.ones()= : Set all elements to 1.
- =.randu()= : Set all elements to uniform distributed random values, i.e., $\mathbb{U}(0, 1)$.
- =.randn()= : Set all elements to standard Gaussian distributed random values, i.e., $\mathbb{N}(0, 1)$.
- =.fill(value)= : Set all the elements to =value=.
- =.replace(old_value, new_value)= : For all elements equal to =old_value=, set them to =new_value=.
- =.clean(threshold)= : Replace each element with absolute value no larger than =threshold= by zero. For each complex element, its real and imaginary parts are individually replaced, irrespective of its absolute value and amplitude.
- =.reset()= : Reset the size to zero, i.e., empty the object.
- =.set_size(n_elem)= / =.set_size(n_rows, n_cols)= / =.set_size(n_rows, n_cols, n_slices)= / =.set_size(size(X))= : Change the size of the object without preserving data.
- =.copy_size(X)= : Set the size of the object equal to that of object X without preserving data.
- =.resize(n_elem)= / =.resize(n_rows, n_cols)= / =.resize(n_rows, n_cols, n_slices)= / =.resize(size(X))= : Grow/shrink the object while preserving the elements and their layout.
- =.reshape(n_rows, n_cols)= / =.reshape(n_rows, n_cols, n_slices)= / =.reshape(size(X))= : Recreate the object according to the given size using the elements in the previous version. The recreating is performed column by column.
- =.imbue(functor/lambda)= : Fill/set with values yielded by a functor/lambda expression.
- =.transform(functor/lambda)= : Transform each element using a functor/lambda expression.
- =.for_each(functor/lambda)= : Process the object by passing each element to a functor/lambda expression.
- =.set_real(X)= / =.set_imag(X)= : Set the real/imaginary part of an object. =X= must have the same size as the underlying object.
- =.insert_rows(idx, X)= : Insert =X= at =idx= th row for a column-vector/matrix/cube.
- =.insert_rows(idx, row_num)= : Insert =row_num= rows at =idx= th row for a column-vector/matrix/cube, and the =row_num= rows inserted are all set to 0.
- =.insert_cols(idx, X)= : Insert =X= at =idx= th column for a row-vector/matrix/cube.
- =.insert_cols(idx, col_num)= : Insert =col_num= columns at =idx= th column for a column-vector/matrix/cube, and the =col_num= columns inserted are all set to 0.
- =.shed_row(idx)= : Remove =idx= th row from the underlying column-vector/matrix/cube.
- =.shed_rows(first, last)= : Remove the rows between =first= th and =last= th rows from the underlying column-vector/matrix/cube.
- =.shed_col(idx)= : Remove =idx= th column from the underlying row-vector/matrix/cube.
- =.shed_cols(first, last)= : Remove the columns between =first= th and =last= th columns from the underlying row-vector/matrix/cube.
- =.swap_rows(idx1, idx2)= : Swap 2 rows of the underlying column-vector/matrix.
- =.swap_cols(idx1, idx2)= : Swap 2 columns of the underlying row-vector/matrix.
- =.min()= / =.max()= : Return the extreme[fn:6] value of a matrix or a cube.
- =.index_min()= / =.index_max()= : Return the linear index of the extreme[fn:6] value of a matrix or a cube.
- =.in_range= : Check the validity of a given location, e.g., return =false= for an empty object, out-of-bounds.
- =.is_empty()= : Check the object whether it is empty.
- =.is_sorted(sort_direction = "ascend", dim = 0)= : Check a vector or a matrix.
- =.print()= / =.print(header)= / =.print(stream)= / =.print(stream, header)= : Print the content of the object.
- =.save= / =.load=

*Notes*: Functions =.zeros=, =.ones=, =.randu=, =.randn=, =.eye= above can also take dimensions as arguments to set the length and size of the object. In this case, it combines the operations of argument-free provoking and =.set_size=.
** Overloaded operators
A rich number of operators have been overloaded for column/row vector, matrix and cube classes, e.g.,
- =*= : Matrix multiplication of two objects, but not applicable to cube, unless multiplying by a scalar.
- =%= : Element-wise multiplication, a.k.a. Schur product.
- =/= : Element-wise division of an object by another object or a scalar.
- ==== / =!== : Element-wise equality/non-equality evaluation
- =>= / =<= / =>== / =<== : Element-wise comparsion
- =&&= / =||= : Element-wise logical AND/OR evaluation
** Element access
- =(n)= : Access the $n$ th element of a vector/matrix/cube or $n$ th object of a field.
- =.at(n)= / =[n]= : Similar to =(n)=, but without a bound check[fn:3].
- =(i, j)= : Access the element in $i$ th row and $j$ th column of a matrix, or the object in $i$ th row and $j$ th column of a 2D field.
- =.at(i, j)= : Similar to =(i, j)=, but without a bound check.
- =(i, j, k)= : Access the element in $i$ th row, $j$ th column, and $k$ th slice; or the object in $i$ th row, $j$ th column, and $k$ th slice for a 3D field.
- =.at(i, j, k)= : Similar to =(i, j, k)=, but without bound check.

Note that, 2D index using rectangle bracket (e.g., $[i, j]$, $[i, j, k]$) does not work correctly. We should use $(i, j)$, $(i, j, k)$ instead.
*** Iterators
In armadillo, matrices/vectors/cubes are somewhat similar to the containers in [[./cpp_stl.org][C++ STL]], and consequently can be accessed via iterators.
**** Member functions
- =.begin()= : Iterator referring to the first element.
- =.end()= : Iterator referring to the /past-the-end/ element.
- =.begin_col(idx)= / =.begin_row(idx)= : Iterator referring to =idx= th column/row of a row/column vector or a matrix.
- =.end_col(idx)= / =.end_row(idx)= : Iterator referring to the past-the-end of =idx= th column/row of a row/column vector or a matrix.
- =.begin_slice(idx)= : Iterator referring to =idx= th slice of a cube.
- =.end_slice(idx)= : Iterator referring to the past-the-end of =idx= th slice of a cube.
**** Iterator types
***** For read/write access
- =mat::iterator= / =vec::iterator= / =rowvec::iterator= / =cube::iterator=
- =mat::col_iterator= / =vec::col_iterator= / =rowvec::col_iterator=
- =mat::row_iterator= / =vec::row_iterator= / =rowvec::row_iterator=
- =cube::slice_iterator=
