cpp_armadillo.html
<div id="outline-container-org3fd839e" class="outline-3">
<h3 id="org3fd839e">Common member functions</h3>
<div class="outline-text-3" id="text-org3fd839e">
<ul class="org-ul">
<li><code>.zeros()</code> : Set all elements to 0.</li>
<li><code>.ones()</code> : Set all elements to 1.</li>
<li><code>.randu()</code> : Set all elements to uniform distributed random values, i.e., \(\mathbb{U}(0, 1)\).</li>
<li><code>.randn()</code> : Set all elements to standard Gaussian distributed random values, i.e., \(\mathbb{N}(0, 1)\).</li>
<li><code>.fill(value)</code> : Set all the elements to <code>value</code>.</li>
<li><code>.replace(old_value, new_value)</code> : For all elements equal to <code>old_value</code>, set them to <code>new_value</code>.</li>
<li><code>.clean(threshold)</code> : Replace each element with absolute value no larger than <code>threshold</code> by zero. For each complex element, its real and imaginary parts are individually replaced, irrespective of its absolute value and amplitude.</li>
<li><code>.reset()</code> : Reset the size to zero, i.e., empty the object.</li>
<li><code>.set_size(n_elem)</code> / <code>.set_size(n_rows, n_cols)</code> / <code>.set_size(n_rows, n_cols, n_slices)</code> / <code>.set_size(size(X))</code> : Change the size of the object without preserving data.</li>
<li><code>.copy_size(X)</code> : Set the size of the object equal to that of object X without preserving data.</li>
<li><code>.resize(n_elem)</code> / <code>.resize(n_rows, n_cols)</code> / <code>.resize(n_rows, n_cols, n_slices)</code> / <code>.resize(size(X))</code> : Grow/shrink the object while preserving the elements and their layout.</li>
<li><code>.reshape(n_rows, n_cols)</code> / <code>.reshape(n_rows, n_cols, n_slices)</code> / <code>.reshape(size(X))</code> : Recreate the object according to the given size using the elements in the previous version. The recreating is performed column by column.</li>
<li><code>.imbue(functor/lambda)</code> : Fill/set with values yielded by a functor/lambda expression.</li>
<li><code>.transform(functor/lambda)</code> : Transform each element using a functor/lambda expression.</li>
<li><code>.for_each(functor/lambda)</code> : Process the object by passing each element to a functor/lambda expression.</li>
<li><code>.set_real(X)</code> / <code>.set_imag(X)</code> : Set the real/imaginary part of an object. <code>X</code> must have the same size as the underlying object.</li>
<li><code>.insert_rows(idx, X)</code> : Insert <code>X</code> at <code>idx</code> th row for a column-vector/matrix/cube.</li>
<li><code>.insert_rows(idx, row_num)</code> : Insert <code>row_num</code> rows at <code>idx</code> th row for a column-vector/matrix/cube, and the <code>row_num</code> rows inserted are all set to 0.</li>
<li><code>.insert_cols(idx, X)</code> : Insert <code>X</code> at <code>idx</code> th column for a row-vector/matrix/cube.</li>
<li><code>.insert_cols(idx, col_num)</code> : Insert <code>col_num</code> columns at <code>idx</code> th column for a column-vector/matrix/cube, and the <code>col_num</code> columns inserted are all set to 0.</li>
<li><code>.shed_row(idx)</code> : Remove <code>idx</code> th row from the underlying column-vector/matrix/cube.</li>
<li><code>.shed_rows(first, last)</code> : Remove the rows between <code>first</code> th and <code>last</code> th rows from the underlying column-vector/matrix/cube.</li>
<li><code>.shed_col(idx)</code> : Remove <code>idx</code> th column from the underlying row-vector/matrix/cube.</li>
<li><code>.shed_cols(first, last)</code> : Remove the columns between <code>first</code> th and <code>last</code> th columns from the underlying row-vector/matrix/cube.</li>
<li><code>.swap_rows(idx1, idx2)</code> : Swap 2 rows of the underlying column-vector/matrix.</li>
<li><code>.swap_cols(idx1, idx2)</code> : Swap 2 columns of the underlying row-vector/matrix.</li>
<li><code>.min()</code> / <code>.max()</code> : Return the extreme<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> value of a matrix or a cube.</li>
<li><code>.index_min()</code> / <code>.index_max()</code> : Return the linear index of the extreme<sup><a id="fnr.5.100" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> value of a matrix or a cube.</li>
<li><code>.in_range</code> : Check the validity of a given location, e.g., return <code>false</code> for an empty object, out-of-bounds.</li>
<li><code>.is_empty()</code> : Check the object whether it is empty.</li>
<li><code>.is_sorted(sort_direction = "ascend", dim = 0)</code> : Check a vector or a matrix.</li>
<li><code>.print()</code> / <code>.print(header)</code> / <code>.print(stream)</code> / <code>.print(stream, header)</code> : Print the content of the object.</li>
<li><code>.save</code> / <code>.load</code></li>
</ul>

<p>
<b>Notes</b>: Functions <code>.zeros</code>, <code>.ones</code>, <code>.randu</code>, <code>.randn</code>, <code>.eye</code> above can also take dimensions as arguments to set the length and size of the object. In this case, it combines the operations of argument-free provoking and <code>.set_size</code>.
</p>
</div>
</div>
<div id="outline-container-orgb6b7ca6" class="outline-3">
<h3 id="orgb6b7ca6">Overloaded operators</h3>
<div class="outline-text-3" id="text-orgb6b7ca6">
<p>
A rich number of operators have been overloaded for column/row vector, matrix and cube classes, e.g.,
</p>
<ul class="org-ul">
<li><code>*</code> : Matrix multiplication of two objects, but not applicable to cube, unless multiplying by a scalar.</li>
<li><code>%</code> : Element-wise multiplication, a.k.a. Schur product.</li>
<li><code>/</code> : Element-wise division of an object by another object or a scalar.</li>
<li><code>==</code> / <code>!=</code> : Element-wise equality/non-equality evaluation</li>
<li><code>&gt;</code> / <code>&lt;</code> / <code>&gt;=</code> / <code>&lt;=</code> : Element-wise comparsion</li>
<li><code>&amp;&amp;</code> / <code>||</code> : Element-wise logical AND/OR evaluation</li>
</ul>
</div>
</div>
<div id="outline-container-orgcdd042e" class="outline-3">
<h3 id="orgcdd042e">Element access</h3>
<div class="outline-text-3" id="text-orgcdd042e">
<ul class="org-ul">
<li><code>(n)</code> : Access the \(n\) th element of a vector/matrix/cube or \(n\) th object of a field.</li>
<li><code>.at(n)</code> / <code>[n]</code> : Similar to <code>(n)</code>, but without a bound check<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>.</li>
<li><code>(i, j)</code> : Access the element in \(i\) th row and \(j\) th column of a matrix, or the object in \(i\) th row and \(j\) th column of a 2D field.</li>
<li><code>.at(i, j)</code> : Similar to <code>(i, j)</code>, but without a bound check.</li>
<li><code>(i, j, k)</code> : Access the element in \(i\) th row, \(j\) th column, and \(k\) th slice; or the object in \(i\) th row, \(j\) th column, and \(k\) th slice for a 3D field.</li>
<li><code>.at(i, j, k)</code> : Similar to <code>(i, j, k)</code>, but without bound check.</li>
</ul>

<p>
Note that, 2D index using rectangle bracket (e.g., \([i, j]\), \([i, j, k]\)) does not work correctly. We should use \((i, j)\), \((i, j, k)\) instead.
</p>
</div>
<div id="outline-container-org32e2209" class="outline-4">
<h4 id="org32e2209">Iterators</h4>
<div class="outline-text-4" id="text-org32e2209">
<p>
In armadillo, matrices/vectors/cubes are somewhat similar to the containers in <a href="./cpp_stl.html">C++ STL</a>, and consequently can be accessed via iterators.
</p>
</div>
<div id="outline-container-orgeb43b6b" class="outline-5">
<h5 id="orgeb43b6b">Member functions</h5>
<div class="outline-text-5" id="text-orgeb43b6b">
<ul class="org-ul">
<li><code>.begin()</code> : Iterator referring to the first element.</li>
<li><code>.end()</code> : Iterator referring to the <i>past-the-end</i> element.</li>
<li><code>.begin_col(idx)</code> / <code>.begin_row(idx)</code> : Iterator referring to <code>idx</code> th column/row of a row/column vector or a matrix.</li>
<li><code>.end_col(idx)</code> / <code>.end_row(idx)</code> : Iterator referring to the past-the-end of <code>idx</code> th column/row of a row/column vector or a matrix.</li>
<li><code>.begin_slice(idx)</code> : Iterator referring to <code>idx</code> th slice of a cube.</li>
<li><code>.end_slice(idx)</code> : Iterator referring to the past-the-end of <code>idx</code> th slice of a cube.</li>
</ul>
</div>
</div>
<div id="outline-container-org4df0453" class="outline-5">
<h5 id="org4df0453">Iterator types</h5>
<div class="outline-text-5" id="text-org4df0453">
</div>
<div id="outline-container-orge679364" class="outline-6">
<h6 id="orge679364">For read/write access</h6>
<div class="outline-text-6" id="text-orge679364">
<ul class="org-ul">
<li><code>mat::iterator</code> / <code>vec::iterator</code> / <code>rowvec::iterator</code> / <code>cube::iterator</code></li>
<li><code>mat::col_iterator</code> / <code>vec::col_iterator</code> / <code>rowvec::col_iterator</code></li>
<li><code>mat::row_iterator</code> / <code>vec::row_iterator</code> / <code>rowvec::row_iterator</code></li>
<li><code>cube::slice_iterator</code></li>
</ul>
</div>
</div>
