cpp_armadillo.org
***** For read-only access
- =mat::const_iterator= / =vec::const_iterator= / =rowvec::const_iterator= / =cube::const_iterator=
- =mat::const_col_iterator= / =vec::const_col_iterator= / =rowvec::const_col_iterator=
- =mat::const_row_iterator= / =vec::const_row_iterator= / =rowvec::const_row_iterator=
- =cube::const_slice_iterator=
*** Container-compatible functions
- =.front()= / =.back()= : Access the first/last element in a vector.
- =.clear()= : Empty the object.
- =.empty()= : Return =true/false= for an empty/non-empty object.
- =.size()= : Total number of elements in the object, i.e., =.n_elem=.

** Generation
- =ones(size(X))= / =zeros(size(X))=
- =randu= / =randi= / =randn= / =randg=
*** Matrix
- =eye(n_rows, n_cols)= / =eye(size(X))=
- =ones(n_rows, n_cols)= / =zeros(n_rows, n_cols)=
- =toeplitz= / =circ_toeplitz=
- =diagmat(X, k=0)=
- =trimatu(X, k)= / =trimatl(X, k)=
*** Vector
- =ones(n_elem)= / =zeros(n_elem)=
- =linspace(start, end, N=100)=
- =logspace(a, b, N=50)=: Generate a logarithmically spaced vector from $10^a$ to $10^b$ (included).
- =regspace(start, end)= / =regspace(start, step, end)=
- =randperm(N)= / =randperm(N, M)= : Generate a vector with random permutation of integers from =0= to =N-1=.
- =diagvec(X, k=0)=
*** Cube
- =ones(n_rows, n_cols, n_slices)= / =zeros(n_rows, n_cols, n_slices)=
** Functions
- =abs(X)= / =arg(X)= : Per-element absolute values or phase angles (in radians)
- =conj(X)= : Per-element complex conjugate
- =accu(X)= : Sum all elements.
- =sum(X, dim=0)=
- =all(V)= / =all(X, dim)= : Check whether all the elements (in dimension =dim=) are non-zero.
- =any(V)= / =any(X, dim)= : Check whether there is any non-zero element (dimension =dim=) exist.
- =conv_to<type>::from(X)= : Type convertion/cast
- =diff(V, k=0)= / =diff(X, k, dim=0)=
- =real(X)= / =imag(X)=
- =min= / =max=
- =norm(X, p=2)=
- =pow=
- =shuffle(X, dim=0)=
- =sort= / =sort_index=
- =unique(X)=
- =vectorise(X, dim=0)= : Concatenate all the columns (dim=0) or rows (dim=1).
- =fft= / =ifft=
- =cor= / =cov= : Correlation/covariance
- Statistics: =mean=, =median=, =stddev=, =var=, =range=, =hist= / =histc=, =quantile=.
*** Matrix
- =as_scalar(expression)= : Convert the =expression= (resulting a 1x1 matrix) to a scalar.
- =cond(X)= / =rcond(X)= : Calculate the (reciprocal) condition number of a matrix.
- =det(X)= / =log_det(X)= / =log_det_sympd(X)=
- =trace(X)=
- =expmat(X)= / =expmat_sym(X)= : Matrix exponential of a square (symmetric/Hermitian) matrix.
- =trans(X)= / =strans(X)=
- =fliplr(X)= / =flipud(X)=
- =inv= / =inv_sympd= / =pinv=
- =intersect(A, B)=
- =join_rows(A, B, ...)= / =join_horiz(A, B, ...)=
- =join_cols(A, B, ...)= / =join_vert(A, B, ...)=
- =kron(A, B)=
- =fft2= / =ifft2=
- =normalise(X, p=2, dim=0)= : Return the normalized version with unit =p= norm along the dimension =dim=.
- =powmat(X, n)= / =sqrtmat(X)= / =sqrtmat_sympd(X)=
- =rank(X)=
- =trimatu_ind(size(X), k)= / =trimatl_ind(size(X), k)= : Return a column vector containing the indices of elements that form the upper/lower triangle part of matrix.
- =orth(X)= : Find the orthonormal basis of the range space of the matrix.
- =conv2(a, b)= : 2D convolution
- Decomposition: =chol=, =eig_sym= / =eig_gen=, =lu=, =qr=, =svd=, =svd_econ=.
*** Vector
- =dot(a, b)= : $a \cdot b$
- =cdot(a, b)= : $a^{*} \cdot b$
- =norm_dot(a, b)= : $\dfrac{a \cdot b}{\|a\|\|b\|}$
- =normalise(V, p=2)= : Return the normalized version with unit =p= norm.
- =roots(P)= : Calculate the complex roots of a polynormial function (represented by =P=).
- =conv(a, b)= : 1D convolution
*** Cube
- =join_slices(A, B)=

** Miscellaneous
*** Constant
The constants are stored in =Datum<type>= class, where =type= can be float or double.
- =datum= is a typedef for =Datum<double>=.
- =fdatum= is a typedef for =Datum<float>=.

| *Expression*                      | *Constant*                                                         |
|-----------------------------------+--------------------------------------------------------------------|
| =datum::pi=                       | $\pi$                                                              |
| =datum::tau=                      | $2\pi$                                                             |
| =datum::inf=                      | $\infty$                                                           |
| =datum::nan=                      | NaN[fn:7]                                                          |
| =datum::eps=                      | $\epsilon$[fn:8]                                                   |
| =datum::e=                        | $e$                                                                |
| =datum::sqrt2=                    | $\sqrt{2}$                                                         |
| =datum::log_min=/=datum::log_max= | Log of minimum/maximum value (type and machine dependent)          |
| =datum::gratio=                   | Golden ratio                                                       |
| =datum::F=                        | Faraday constant (in coulombs)                                     |
| =datum::h=/=datum::h_bar=         | Planck constant ($h$) / reduced Planck constant ($\frac{h}{2\pi}$) |
| =datum::c_0=                      | Speed of light in vacuum (m/s)                                     |
*** Timer
Class =wall_clock= is simple timer to measure the elapsed seconds. It has 2 member functions.
- =.tic()= starts the timer.
- =.toc()= returns the number of seconds since the last call to =.tic()=.

