cpp_armadillo.html
<div id="outline-container-orgbcdb09a" class="outline-6">
<h6 id="orgbcdb09a">For read-only access</h6>
<div class="outline-text-6" id="text-orgbcdb09a">
<ul class="org-ul">
<li><code>mat::const_iterator</code> / <code>vec::const_iterator</code> / <code>rowvec::const_iterator</code> / <code>cube::const_iterator</code></li>
<li><code>mat::const_col_iterator</code> / <code>vec::const_col_iterator</code> / <code>rowvec::const_col_iterator</code></li>
<li><code>mat::const_row_iterator</code> / <code>vec::const_row_iterator</code> / <code>rowvec::const_row_iterator</code></li>
<li><code>cube::const_slice_iterator</code></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd3a4d86" class="outline-4">
<h4 id="orgd3a4d86">Container-compatible functions</h4>
<div class="outline-text-4" id="text-orgd3a4d86">
<ul class="org-ul">
<li><code>.front()</code> / <code>.back()</code> : Access the first/last element in a vector.</li>
<li><code>.clear()</code> : Empty the object.</li>
<li><code>.empty()</code> : Return <code>true/false</code> for an empty/non-empty object.</li>
<li><code>.size()</code> : Total number of elements in the object, i.e., <code>.n_elem</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org52ce5bf" class="outline-3">
<h3 id="org52ce5bf">Generation</h3>
<div class="outline-text-3" id="text-org52ce5bf">
<ul class="org-ul">
<li><code>ones(size(X))</code> / <code>zeros(size(X))</code></li>
<li><code>randu</code> / <code>randi</code> / <code>randn</code> / <code>randg</code></li>
</ul>
</div>
<div id="outline-container-org33e417d" class="outline-4">
<h4 id="org33e417d">Matrix</h4>
<div class="outline-text-4" id="text-org33e417d">
<ul class="org-ul">
<li><code>eye(n_rows, n_cols)</code> / <code>eye(size(X))</code></li>
<li><code>ones(n_rows, n_cols)</code> / <code>zeros(n_rows, n_cols)</code></li>
<li><code>toeplitz</code> / <code>circ_toeplitz</code></li>
<li><code>diagmat(X, k=0)</code></li>
<li><code>trimatu(X, k)</code> / <code>trimatl(X, k)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org2d176c6" class="outline-4">
<h4 id="org2d176c6">Vector</h4>
<div class="outline-text-4" id="text-org2d176c6">
<ul class="org-ul">
<li><code>ones(n_elem)</code> / <code>zeros(n_elem)</code></li>
<li><code>linspace(start, end, N=100)</code></li>
<li><code>logspace(a, b, N=50)</code>: Generate a logarithmically spaced vector from \(10^a\) to \(10^b\) (included).</li>
<li><code>regspace(start, end)</code> / <code>regspace(start, step, end)</code></li>
<li><code>randperm(N)</code> / <code>randperm(N, M)</code> : Generate a vector with random permutation of integers from <code>0</code> to <code>N-1</code>.</li>
<li><code>diagvec(X, k=0)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org872b215" class="outline-4">
<h4 id="org872b215">Cube</h4>
<div class="outline-text-4" id="text-org872b215">
<ul class="org-ul">
<li><code>ones(n_rows, n_cols, n_slices)</code> / <code>zeros(n_rows, n_cols, n_slices)</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8a6871a" class="outline-3">
<h3 id="org8a6871a">Functions</h3>
<div class="outline-text-3" id="text-org8a6871a">
<ul class="org-ul">
<li><code>abs(X)</code> / <code>arg(X)</code> : Per-element absolute values or phase angles (in radians)</li>
<li><code>conj(X)</code> : Per-element complex conjugate</li>
<li><code>accu(X)</code> : Sum all elements.</li>
<li><code>sum(X, dim=0)</code></li>
<li><code>all(V)</code> / <code>all(X, dim)</code> : Check whether all the elements (in dimension <code>dim</code>) are non-zero.</li>
<li><code>any(V)</code> / <code>any(X, dim)</code> : Check whether there is any non-zero element (dimension <code>dim</code>) exist.</li>
<li><code>conv_to&lt;type&gt;::from(X)</code> : Type convertion/cast</li>
<li><code>diff(V, k=0)</code> / <code>diff(X, k, dim=0)</code></li>
<li><code>real(X)</code> / <code>imag(X)</code></li>
<li><code>min</code> / <code>max</code></li>
<li><code>norm(X, p=2)</code></li>
<li><code>pow</code></li>
<li><code>shuffle(X, dim=0)</code></li>
<li><code>sort</code> / <code>sort_index</code></li>
<li><code>unique(X)</code></li>
<li><code>vectorise(X, dim=0)</code> : Concatenate all the columns (dim=0) or rows (dim=1).</li>
<li><code>fft</code> / <code>ifft</code></li>
<li><code>cor</code> / <code>cov</code> : Correlation/covariance</li>
<li>Statistics: <code>mean</code>, <code>median</code>, <code>stddev</code>, <code>var</code>, <code>range</code>, <code>hist</code> / <code>histc</code>, <code>quantile</code>.</li>
</ul>
</div>
<div id="outline-container-orgb779166" class="outline-4">
<h4 id="orgb779166">Matrix</h4>
<div class="outline-text-4" id="text-orgb779166">
<ul class="org-ul">
<li><code>as_scalar(expression)</code> : Convert the <code>expression</code> (resulting a 1x1 matrix) to a scalar.</li>
<li><code>cond(X)</code> / <code>rcond(X)</code> : Calculate the (reciprocal) condition number of a matrix.</li>
<li><code>det(X)</code> / <code>log_det(X)</code> / <code>log_det_sympd(X)</code></li>
<li><code>trace(X)</code></li>
<li><code>expmat(X)</code> / <code>expmat_sym(X)</code> : Matrix exponential of a square (symmetric/Hermitian) matrix.</li>
<li><code>trans(X)</code> / <code>strans(X)</code></li>
<li><code>fliplr(X)</code> / <code>flipud(X)</code></li>
<li><code>inv</code> / <code>inv_sympd</code> / <code>pinv</code></li>
<li><code>intersect(A, B)</code></li>
<li><code>join_rows(A, B, ...)</code> / <code>join_horiz(A, B, ...)</code></li>
<li><code>join_cols(A, B, ...)</code> / <code>join_vert(A, B, ...)</code></li>
<li><code>kron(A, B)</code></li>
<li><code>fft2</code> / <code>ifft2</code></li>
<li><code>normalise(X, p=2, dim=0)</code> : Return the normalized version with unit <code>p</code> norm along the dimension <code>dim</code>.</li>
<li><code>powmat(X, n)</code> / <code>sqrtmat(X)</code> / <code>sqrtmat_sympd(X)</code></li>
<li><code>rank(X)</code></li>
<li><code>trimatu_ind(size(X), k)</code> / <code>trimatl_ind(size(X), k)</code> : Return a column vector containing the indices of elements that form the upper/lower triangle part of matrix.</li>
<li><code>orth(X)</code> : Find the orthonormal basis of the range space of the matrix.</li>
<li><code>conv2(a, b)</code> : 2D convolution</li>
<li>Decomposition: <code>chol</code>, <code>eig_sym</code> / <code>eig_gen</code>, <code>lu</code>, <code>qr</code>, <code>svd</code>, <code>svd_econ</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org7462d4c" class="outline-4">
<h4 id="org7462d4c">Vector</h4>
<div class="outline-text-4" id="text-org7462d4c">
<ul class="org-ul">
<li><code>dot(a, b)</code> : \(a \cdot b\)</li>
<li><code>cdot(a, b)</code> : \(a^{*} \cdot b\)</li>
<li><code>norm_dot(a, b)</code> : \(\dfrac{a \cdot b}{\|a\|\|b\|}\)</li>
<li><code>normalise(V, p=2)</code> : Return the normalized version with unit <code>p</code> norm.</li>
<li><code>roots(P)</code> : Calculate the complex roots of a polynormial function (represented by <code>P</code>).</li>
<li><code>conv(a, b)</code> : 1D convolution</li>
</ul>
</div>
</div>
<div id="outline-container-org39491bc" class="outline-4">
<h4 id="org39491bc">Cube</h4>
<div class="outline-text-4" id="text-org39491bc">
<ul class="org-ul">
<li><code>join_slices(A, B)</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6b12521" class="outline-3">
<h3 id="org6b12521">Miscellaneous</h3>
<div class="outline-text-3" id="text-org6b12521">
</div>
<div id="outline-container-orgf1c5857" class="outline-4">
<h4 id="orgf1c5857">Constant</h4>
<div class="outline-text-4" id="text-orgf1c5857">
<p>
The constants are stored in <code>Datum&lt;type&gt;</code> class, where <code>type</code> can be float or double.
</p>
<ul class="org-ul">
<li><code>datum</code> is a typedef for <code>Datum&lt;double&gt;</code>.</li>
<li><code>fdatum</code> is a typedef for <code>Datum&lt;float&gt;</code>.</li>
</ul>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Expression</b></th>
<th scope="col" class="org-left"><b>Constant</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>datum::pi</code></td>
<td class="org-left">\(\pi\)</td>
</tr>

<tr>
<td class="org-left"><code>datum::tau</code></td>
<td class="org-left">\(2\pi\)</td>
</tr>

<tr>
<td class="org-left"><code>datum::inf</code></td>
<td class="org-left">\(\infty\)</td>
</tr>

<tr>
<td class="org-left"><code>datum::nan</code></td>
<td class="org-left">NaN<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup></td>
</tr>

<tr>
<td class="org-left"><code>datum::eps</code></td>
<td class="org-left">\(\epsilon\)<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup></td>
</tr>

<tr>
<td class="org-left"><code>datum::e</code></td>
<td class="org-left">\(e\)</td>
</tr>

<tr>
<td class="org-left"><code>datum::sqrt2</code></td>
<td class="org-left">\(\sqrt{2}\)</td>
</tr>

<tr>
<td class="org-left"><code>datum::log_min=/=datum::log_max</code></td>
<td class="org-left">Log of minimum/maximum value (type and machine dependent)</td>
</tr>

<tr>
<td class="org-left"><code>datum::gratio</code></td>
<td class="org-left">Golden ratio</td>
</tr>

<tr>
<td class="org-left"><code>datum::F</code></td>
<td class="org-left">Faraday constant (in coulombs)</td>
</tr>

<tr>
<td class="org-left"><code>datum::h=/=datum::h_bar</code></td>
<td class="org-left">Planck constant (\(h\)) / reduced Planck constant (\(\frac{h}{2\pi}\))</td>
</tr>

<tr>
<td class="org-left"><code>datum::c_0</code></td>
<td class="org-left">Speed of light in vacuum (m/s)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org94c9909" class="outline-4">
<h4 id="org94c9909">Timer</h4>
<div class="outline-text-4" id="text-org94c9909">
<p>
Class <code>wall_clock</code> is simple timer to measure the elapsed seconds. It has 2 member functions.
</p>
<ul class="org-ul">
<li><code>.tic()</code> starts the timer.</li>
<li><code>.toc()</code> returns the number of seconds since the last call to <code>.tic()</code>.</li>
</ul>
</div>
</div>
</div>
</div>
