cpp_armadillo.org
* Footnotes
[fn:8] Machine epsilon, i.e., difference between 1 and the next representable value. 
[fn:7] Not a number (NaN) does not equal anything, even itself.
[fn:6] For a complex matrix/cube, absolute values are compared.
[fn:5] Reduce to transposition for real matrices. 
[fn:4] /Tube/ is a subcube across all the slices. 
[fn:3] For this reason, it is not recommended. 
[fn:2] https://gitlab.com/conradsnicta/armadillo-code.git
[fn:1] https://arma.sourceforge.net
